NSCameraUsageDescription = "Der Zugriff auf die Kamera wird benötigt, um Dokumente zu scannen und Fotos und Videos aufzunehmen.";
NSFaceIDUsageDescription = "Face ID ist für die Authentifizierung per Gesichtserkennung erforderlich.";
NSLocationAlwaysUsageDescription = "Die App verwendet Ihren Standort, um automatisch Datei-Uploads anzustoßen, wenn Sie sich zwischen Bereichen bewegen.";
NSPhotoLibraryUsageDescription = "Der Zugriff auf die Fotobibliothek ist erforderlich, um Ihre Fotos und Videos in Ihre Cloud hochzuladen.";
NSPhotoLibraryAddUsageDescription = "Der Zugriff auf die Fotobibliothek ist erforderlich, um Ihre Fotos und Videos in Ihre Cloud hochzuladen.";
NSMicrophoneUsageDescription = "Zum Erstellen von Sprachnotizen ist der Zugriff auf das Mikrofon erforderlich.";
NSLocationWhenInUseUsageDescription = "Diese App nutzt Ihren Standort, um Bewegungen zu erkennen und automatisch Dateien hochzuladen. Sie verwendet kein GPS und speichert Ihren Standort nicht.";
NSLocationAlwaysAndWhenInUseUsageDescription = "Diese App benötigt auch im Hintergrund Zugriff auf Ihren Standort, um bei Erkennung signifikanter Bewegungen automatisch mit dem Hochladen von Dateien zu beginnen. GPS wird nicht verwendet.";
NSUserTrackingUsageDescription = "Die Telekom verwendet die Apple-Advertising-ID, um die Funktionsweise der App anhand der Nutzerbedürfnisse zu optimieren und weiterzuentwickeln, etwaige Fehler zu beheben sowie um Ihnen bedarfsgerechte Werbung in der App und auf Drittseiten auszuspielen. Ihre Einwilligung können Sie jederzeit im Betriebssystem widerrufen.";
